Revit 2027 API
BuiltInFailures.RoofFailures.WorkplaneShouldBeLevel Property
 Can't use Workplane that is not a Level. Set the desired Level as current Workplane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WorkplaneShouldBeLevel { get; }
Public Shared ReadOnly Property WorkplaneShouldBeLevel As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WorkplaneShouldBeLevel {
	FailureDefinitionId^ get ();
}
static member WorkplaneShouldBeLevel : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoofFailures Class
Autodesk.Revit.DB Namespace